CSI API ETABS v1
cPropFrame.GetNameInPropFile Method
 Retrieves the names of the section property file from which an imported frame section originated, and it also retrieves the section name used in the property file.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetNameInPropFile(
	string Name,
	ref string NameInFile,
	ref string FileName,
	ref string MatProp,
	ref eFramePropType PropType
)
Function GetNameInPropFile (
	Name As String,
	ByRef NameInFile As String,
	ByRef FileName As String,
	ByRef MatProp As String,
	ByRef PropType As eFramePropType
) As Integer
Dim instance As cPropFrame
Dim Name As String
Dim NameInFile As String
Dim FileName As String
Dim MatProp As String
Dim PropType As eFramePropType
Dim returnValue As Integer
returnValue = instance.GetNameInPropFile(Name,
	NameInFile, FileName, MatProp, PropType)
int GetNameInPropFile(
	String^ Name,
	String^% NameInFile,
	String^% FileName,
	String^% MatProp,
	eFramePropType% PropType
)
abstract GetNameInPropFile :
        Name : string *
        NameInFile : string byref *
        FileName : string byref *
        MatProp : string byref *
        PropType : eFramePropType byref -> int
Parameters
Name
Type: System.String
 The name of an existing frame section property.
NameInFile
Type: System.String
 The name of the specified frame section property in the frame section property file.
FileName
Type: System.String
 The name of the frame section property file from which the specified frame section property was obtained.
MatProp
Type: System.String
 The name of the material property for the section.
PropType
Type: ETABSv1.eFramePropType
 This is one of the items in the eFramePropType enumeration.
Return Value
Type: Int32
 Returns zero if the names are successfully retrieved; otherwise it returns nonzero.
Remarks
 If the specified frame section property was not imported, blank strings are returned for NameInFile and FileName.
Examples
Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
       Dim NameInFile As String
       Dim FileName As String
       Dim MatProp As String
       Dim PropType As eFramePropType
   'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
   'start ETABS application
       ret = EtabsObject.ApplicationStart()
   'create SapModel object
       SapModel = EtabsObject.SapModel
   'initialize model
       ret = SapModel.InitializeNewModel()
   'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4,12,12,4,4,24,24)
   'import new frame section property
       ret = SapModel.PropFrame.ImportProp("MyFrame", "A992Fy50", "Sections8.pro", "W18X35")
   'get frame property name in file
       ret = SapModel.PropFrame.GetNameInPropFile("MyFrame", NameInFile, FileName, MatProp, PropType)
   'close ETABS
       EtabsObject.ApplicationExit(False)
   'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing
   End Sub
See Also
Reference
cPropFrame Interface
ETABSv1 Namespace